Repository: marmot-protocol/whitenoise-ios
Catalog: Shared/Localizable.xcstrings
Source language: en
Languages: de, es, fr, it, pt, ru, tr, zh_hans, zh_hant

source: This is an installation prompt for connecting this OpenCode setup to White Noise through Marmot. Read the latest connector guide at https://github.com/marmot-protocol/mdk/blob/master/crates/agent-connector/README.md. Explain to me how the connector works and what the installation will change. Then propose the installation steps for my public npub: %@, and ask for my approval before making any changes. Once I approve, install and verify the connector, then reply with your agent npub.
de: Dies ist eine Installationsanweisung, um diese OpenCode-Einrichtung über Marmot mit White Noise zu verbinden. Lies die neueste Konnektor-Anleitung unter https://github.com/marmot-protocol/mdk/blob/master/crates/agent-connector/README.md. Erkläre mir, wie der Konnektor funktioniert und was die Installation ändern wird. Schlage dann die Installationsschritte für meine öffentliche npub vor: %@, und bitte um meine Zustimmung, bevor du Änderungen vornimmst. Sobald ich zugestimmt habe, installiere und überprüfe den Konnektor und antworte dann mit deiner Agenten-npub.
es: Esta es una instrucción de instalación para conectar esta configuración de OpenCode a White Noise mediante Marmot. Lee la guía más reciente del conector en https://github.com/marmot-protocol/mdk/blob/master/crates/agent-connector/README.md. Explícame cómo funciona el conector y qué cambiará la instalación. Después, propón los pasos de instalación para mi npub pública: %@, y pide mi aprobación antes de realizar cualquier cambio. Una vez que lo apruebe, instala y verifica el conector y, después, responde con la npub de tu agente.
fr: Ceci est une invite d’installation pour connecter cette configuration OpenCode à White Noise via Marmot. Lisez le dernier guide du connecteur à l’adresse https://github.com/marmot-protocol/mdk/blob/master/crates/agent-connector/README.md. Expliquez-moi comment le connecteur fonctionne et ce que l’installation va modifier. Proposez ensuite les étapes d’installation pour ma npub publique : %@, et demandez mon approbation avant d’apporter la moindre modification. Une fois mon approbation donnée, installez et vérifiez le connecteur, puis répondez avec la npub de votre agent.
it: Questo è un prompt di installazione per collegare questa configurazione OpenCode a White Noise tramite Marmot. Leggi la guida più recente del connettore all’indirizzo https://github.com/marmot-protocol/mdk/blob/master/crates/agent-connector/README.md. Spiegami come funziona il connettore e cosa cambierà l’installazione. Quindi proponi i passaggi di installazione per la mia npub pubblica: %@ e chiedi la mia approvazione prima di apportare qualsiasi modifica. Dopo la mia approvazione, installa e verifica il connettore, quindi rispondi con la npub del tuo agente.
pt: Este é um prompt de instalação para conectar esta configuração do OpenCode ao White Noise pelo Marmot. Leia o guia mais recente do conector em https://github.com/marmot-protocol/mdk/blob/master/crates/agent-connector/README.md. Explique como o conector funciona e o que a instalação alterará. Em seguida, proponha as etapas de instalação para minha npub pública: %@ e peça minha aprovação antes de fazer qualquer alteração. Depois que eu aprovar, instale e verifique o conector e responda com a npub do seu agente.
ru: Это запрос на установку для подключения этой конфигурации OpenCode к White Noise через Marmot. Прочитайте актуальное руководство по коннектору: https://github.com/marmot-protocol/mdk/blob/master/crates/agent-connector/README.md. Объясните мне, как работает коннектор и что изменит установка. Затем предложите шаги установки для моей публичной npub: %@ и запросите мое одобрение, прежде чем вносить какие-либо изменения. После моего одобрения установите и проверьте коннектор, а затем ответьте npub вашего агента.
tr: Bu bir kurulum istemidir; bu OpenCode kurulumunu Marmot üzerinden White Noise’a bağlar. https://github.com/marmot-protocol/mdk/blob/master/crates/agent-connector/README.md adresindeki en güncel bağlayıcı kılavuzunu okuyun. Bağlayıcının nasıl çalıştığını ve kurulumun neleri değiştireceğini bana açıklayın. Ardından genel npub’ım için kurulum adımlarını önerin: %@ ve herhangi bir değişiklik yapmadan önce onayımı isteyin. Ben onayladıktan sonra bağlayıcıyı kurup doğrulayın ve ardından ajan npub’ınızla yanıt verin.
zh_hans: 这是一条安装提示，用于通过 Marmot 将此 OpenCode 设置连接到 White Noise。请阅读最新的连接器指南：https://github.com/marmot-protocol/mdk/blob/master/crates/agent-connector/README.md。请向我解释连接器的工作方式以及安装会带来哪些更改。然后针对我的公开 npub 提出安装步骤：%@，并在进行任何更改之前请求我的批准。我批准后，请安装并验证连接器，然后回复你的代理 npub。

source: White Noise works with AI agents. Your agent runs on your own machine or server as a separate Marmot account; you chat with it here like any contact, end-to-end encrypted.
de: White Noise funktioniert mit KI-Agenten. Dein Agent läuft auf deinem eigenen Rechner oder Server als separater Marmot-Account; du chattest hier mit ihm wie mit jedem Kontakt, Ende-zu-Ende verschlüsselt.
es: White Noise funciona con agentes de IA. Tu agente se ejecuta en tu propio ordenador o servidor como una cuenta Marmot independiente; aquí chateas con él como con cualquier contacto, con cifrado de extremo a extremo.
fr: White Noise fonctionne avec des agents IA. Votre agent s'exécute sur votre propre machine ou serveur en tant que compte Marmot distinct ; vous discutez avec lui ici comme avec n'importe quel contact, avec chiffrement de bout en bout.
it: White Noise funziona con agenti IA. Il tuo agente gira sul tuo computer o server come account Marmot separato; qui chatti con lui come con qualsiasi contatto, con crittografia end-to-end.
pt: White Noise funciona com agentes de IA. O seu agente roda no seu próprio computador ou servidor como uma conta Marmot separada; aqui você conversa com ele como com qualquer contato, com criptografia de ponta a ponta.
ru: White Noise работает с ИИ-агентами. Ваш агент запускается на вашем компьютере или сервере как отдельный аккаунт Marmot; здесь вы общаетесь с ним как с любым контактом, с сквозным шифрованием.
tr: White Noise yapay zeka ajanlarıyla çalışır. Ajanınız kendi makinenizde veya sunucunuzda ayrı bir Marmot hesabı olarak çalışır; burada onunla herhangi bir kişi gibi uçtan uca şifreli sohbet edersiniz.
zh_hans: White Noise 可与 AI 代理配合使用。你的代理在你自己的电脑或服务器上作为独立的 Marmot 账户运行；你可以在这里像与任何联系人一样与它端到端加密聊天。

source: %@ info
es: %@ información
it: %@ informazioni
pt: Informações sobre %@
ru: %@ информация
tr: %@ bilgisi
zh_hans: %@ 信息
zh_hant: %@ 訊息

source: Admin
es: Administración
fr: Administrateur
it: Ammin
pt: Administrador
ru: Админ
tr: Yönetici
zh_hans: 管理员
zh_hant: 管理員

source: APNS token
es: Token APNS
fr: Jeton APNS
it: Token APNS
pt: Token APNS
ru: Токен APNS
tr: APNS jetonu
zh_hans: APNS 代币
zh_hant: APNS 代幣

source: App
es: Aplicación
pt: Aplicativo
ru: Приложение
tr: Uygulama
zh_hans: 应用
zh_hant: 應用程式

source: Bitcoin Silent Payment
es: Pago silencioso de Bitcoin
fr: Paiement silencieux Bitcoin
it: Pagamento silenzioso Bitcoin
pt: Pagamento silencioso de Bitcoin
ru: Тихий платёж Bitcoin
tr: Bitcoin sessiz ödeme
zh_hans: 比特币静默支付
zh_hant: 比特幣靜默支付

source: Chat Info
es: Información del chat
fr: Infos du chat
it: Info chat
pt: Informações do bate-papo
ru: Информация о чате
tr: Sohbet bilgisi
zh_hans: 聊天信息
zh_hant: 聊天資訊

source: Debugging
es: Depuración
fr: Débogage
it: Debug
pt: Depuração
ru: Отладка
tr: Hata ayıklama
zh_hans: 调试
zh_hant: 除錯

source: Filter
es: Filtro
fr: Filtre
it: Filtro
pt: Filtro
ru: Фильтр
tr: Filtre
zh_hans: 筛选
zh_hant: 篩選

source: Info
es: Información
fr: Infos
pt: Informações
ru: Инфо
tr: Bilgi
zh_hans: 资料
zh_hant: 資料

source: Links
es: Enlaces
fr: Liens
it: Link
ru: Ссылки
tr: Bağlantılar
zh_hans: 链接
zh_hant: 連結

source: Live
es: En vivo
fr: En direct
it: Vivere
pt: Ao vivo
ru: Прямой эфир
tr: Canlı
zh_hans: 实时
zh_hant: 即時

source: Name
es: Nombre
fr: Nom
it: Nome
pt: Nome
ru: Имя
tr: Ad
zh_hans: 名称
zh_hant: 名稱

source: Native push
es: Push nativo
fr: Push natif
it: Push nativo
pt: Push nativo
ru: Нативные push-уведомления
tr: Yerel push
zh_hans: 原生推送
zh_hant: 原生推播

source: OK
es: DE ACUERDO
fr: D'ACCORD
ru: ХОРОШО
tr: TAMAM
zh_hans: 好的
zh_hant: 好的

source: Online
es: En línea
fr: En ligne
it: In linea
ru: В сети
tr: Çevrimiçi
zh_hans: 在线
zh_hant: 線上

source: Optional
es: Opcional
fr: Facultatif
it: Opzionale
pt: Opcional
ru: Необязательный
tr: İsteğe bağlı
zh_hans: 选修的
zh_hant: 選修的

source: Passphrase
es: Frase de contraseña
fr: Phrase secrète
pt: Frase secreta
ru: Парольная фраза
tr: Parola
zh_hans: 密码短语
zh_hant: 密碼短語

source: Phase
es: Fase
it: Fase
pt: Fase
ru: Фаза
tr: Aşama
zh_hans: 阶段
zh_hant: 階段

source: Push server
es: Servidor push
fr: Serveur push
it: Server push
pt: Servidor push
ru: Push-сервер
tr: Sunucuyu itin
zh_hans: 推送服务器
zh_hant: 推播伺服器

source: Scan
es: Escanear
fr: Balayage
it: Scansione
pt: Digitalizar
ru: Сканировать
tr: Tara
zh_hans: 扫描
zh_hant: 掃描

source: Standard
es: Estándar
pt: Padrão
ru: Стандартное
tr: Standart
zh_hans: 标准
zh_hant: 標準

source: Status
es: Estado
fr: État
it: Stato
ru: Статус
tr: Durum
zh_hans: 状态
zh_hant: 狀態

source: Streaming debug
es: Depuración de streaming
fr: Débogage du streaming
it: Debug dello streaming
pt: Depuração de streaming
ru: Потоковая отладка
tr: Akış hata ayıklaması
zh_hans: 流式调试
zh_hant: 串流偵錯

source: Streaming…
es: Transmisión…
pt: Transmissão…
ru: Потоковая передача…
tr: Akış…
zh_hans: 流媒体…
zh_hant: 串流媒體…

source: System
es: Sistema
fr: Système
it: Sistema
pt: Sistema
ru: Системный
tr: Sistem
zh_hans: 跟随系统
zh_hant: 跟隨系統

source: Token Fingerprints
es: Huellas de los tokens
fr: Empreintes des jetons
it: Impronte dei token
pt: Impressões dos tokens
ru: Отпечатки токенов
tr: Token parmak izleri
zh_hans: 令牌指纹
zh_hant: 權杖指紋

source: Transport fanouts
es: Fanouts de transporte
fr: Fanouts de transport
it: Fanout di trasporto
pt: Fanouts de transporte
ru: Транспортные рассылки
tr: Aktarım fanout’ları
zh_hans: 传输扇出
zh_hant: 傳輸扇出

source: Version
es: Versión
it: Versione
pt: Versão
ru: Версия
tr: Sürüm
zh_hans: 版本
zh_hant: 版本

source: Version %@ (%@)
es: Versión %@ (%@)
it: Versione %@ (%@)
pt: Versão %@ (%@)
ru: Версия %@ (%@)
tr: Sürüm %@ (%@)
zh_hans: 版本 %@ (%@)
zh_hant: 版 %@ (%@)

source: Version %lld
es: Versión %lld
it: Versione %lld
pt: Versão %lld
ru: Версия %lld
tr: Sürüm %lld
zh_hans: 版本 %lld
zh_hant: 版本 %lld

source: Videos
es: Vídeos
fr: Vidéos
it: Video
pt: Vídeos
ru: Видео
tr: Videolar
zh_hans: 视频
zh_hant: 影片

source: Website
es: Sitio web
fr: Site web
it: Sito web
pt: Site
ru: Веб-сайт
tr: Web sitesi
zh_hans: 网站
zh_hant: 網站

source: White Noise Support
es: Soporte de White Noise
fr: Assistance White Noise
it: Supporto White Noise
pt: Suporte do White Noise
ru: Поддержка White Noise
tr: White Noise Destek
zh_hans: White Noise 支持
zh_hant: White Noise 支援

source: wss://relay.example.com
es: wss://rele.ejemplo.com
fr: wss://relais.exemple.com

source: Open-source coding agent
es: Agente de programación de código abierto
fr: Agent de code open source
it: Agente di coding open source
pt: Agente de código open source
ru: Агент программирования с открытым исходным кодом
tr: Açık kaynak kodlama ajanı
zh_hans: 开源编程代理

source: OpenAI Codex CLI coding agent
es: Agente de codificación CLI de OpenAI Codex
fr: Agent de codage CLI OpenAI Codex
it: Agente di codifica CLI OpenAI Codex
pt: Agente de codificação CLI do OpenAI Codex
ru: Агент для кодирования CLI OpenAI Codex
tr: OpenAI Codex CLI kodlama ajanı
zh_hans: OpenAI Codex CLI 编码代理

source: Chats
fr: Discussions
it: Chat
pt: Bate-papos
ru: Чаты
tr: Sohbetler
zh_hans: 聊天
zh_hant: 聊天

source: GIFs
fr: GIF
it: GIF
ru: GIF
tr: GIF’ler
zh_hans: GIF
zh_hant: GIF

source: Original
fr: Originale
it: Originale
ru: Оригинал
tr: Orijinal
zh_hans: 原始
zh_hant: 原始

source: stream %@
fr: flux %@
ru: поток %@
tr: akış %@
zh_hans: 流 %@
zh_hant: 串流 %@

source: Audio
pt: Áudio
ru: Аудио
tr: Ses
zh_hans: 音频
zh_hant: 音訊

source: Bitcoin
ru: Биткоин
zh_hans: 比特币
zh_hant: 比特幣
